_files/TrackService/track-request.xml

<?xml version="1.0" encoding="utf-8"?>

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Body>
        <TrackRequest xmlns="http://fedex.com/ws/track/v16">
            <WebAuthenticationDetail>
                <UserCredential>
                    <Key>********</Key>
                    <Password>********</Password>
                </UserCredential>
            </WebAuthenticationDetail>
            <ClientDetail>
                <AccountNumber>********</AccountNumber>
                <MeterNumber>********</MeterNumber>
            </ClientDetail>
            <Version>
                <ServiceId>trck</ServiceId>
                <Major>16</Major>
                <Intermediate>0</Intermediate>
                <Minor>0</Minor>
            </Version>
            <SelectionDetails>
                <PackageIdentifier>
                    <Type>TRACKING_NUMBER_OR_DOORTAG</Type>
                    <Value>394721122728</Value>
                </PackageIdentifier>
            </SelectionDetails>
            <SelectionDetails>
                <PackageIdentifier>
                    <Type>TRACKING_NUMBER_OR_DOORTAG</Type>
                    <Value>394645938300</Value>
                </PackageIdentifier>
            </SelectionDetails>
        </TrackRequest>
    </Body>
</Envelope>
